LEXICON_RU: dict[str, str] = {
    '/help': 'Для того, чтобы узнать прогноз погоды или настроить бота под себя, откройте меню\U0001f609',
    '/weather': '\u26c5<b>Прогноз погоды</b>\u26c5\n\
                \nВыберите нужный вариант',
    'lang_success': '\u2705Язык установлен.\
                    \nТеперь установим местоположение\U0001f30d',
    'loc_success': '\u2705Местоположение установлено\n\
                    \nТеперь выбери единицы измерения температуры',
    'temp_success': '\u2705Единицы измерения температуры установлены\n\
                    \nДля завершения настройки осталось выбрать единицы измерения скорости ветра',
    'settings_completed': '\U0001f3c1Настройка бота завершена!\n\
                            \nТеперь вы можете открыть меню и получить прогноз погоды',
    'weather_today': '<b>Вот погода на данный момент:</b>\n\n',
    'weather_week': '<b>Выберите нужный день:</b>',
    'plots': '<b>Выберите нужный график:</b>',
    'your_profile': 'Вот ваши текущие настройки:'
}

KB_LEXICON_RU: dict[str, str] = {
    'get_location': 'Установить местоположение',
    'celsius': '\u00b0C',
    'fahrenheit': '\u00b0F',
    'mps': 'м/с',
    'kmph': 'км/ч',
    'today': 'Прогноз погоды на сегодня',
    'week': 'Прогноз погоды на следующие дни',
    'plots': 'Графики погоды',
    'temp': 'График температуры',
    'wind': 'График ветра',
    'precip': 'График осадков',
    'humid': 'График влажности',
    'back': '\U0001f519Назад'
}

ERROR_LEXICON_RU: dict[str, str] = {
    'GetWeatherError': 'Что-то пошло не так.\U0001f622\
                        \nПовторите попытку позже'
}
